Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "w8tfoe" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.dns_terraform_role must be replaced
-/+ resource "aws_iam_role" "dns_terraform_role" {
      ~ arn                   = "arn:aws:iam::825765422855:role/animeutopia_DNSROLE" -> (known after apply)
      ~ create_date           = "2025-04-01T22:39:10Z" -> (known after apply)
      ~ id                    = "animeutopia_DNSROLE" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "animeutopia_DNSROLE" -> "animeutopia_DNSRole" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROA4AQ3UM4DZA6YZYBFR" -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "DNSTerraformPolicy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "route53:ListResourceRecordSets",
                              - "route53:ListHostedZonesByName",
                              - "route53:ListHostedZones",
                              - "route53:GetHostedZone",
                              - "route53:GetChange",
                              - "route53:ChangeResourceRecordSets",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "Route53Permissions"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.dns_terraform_policy must be replaced
-/+ resource "aws_iam_role_policy" "dns_terraform_policy" {
      ~ id          = "animeutopia_DNSROLE:DNSTerraformPolicy" -> (known after apply)
        name        = "DNSTerraformPolicy"
      + name_prefix = (known after apply)
      ~ role        = "animeutopia_DNSROLE" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 2 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```